{
    "movieReview": [
        {
            "id": 1,
            "movieName": "The Way of Water - อวตาร: วิถีแห่งสายน้ำ",
            "movieLength": 192,
            "director": "James Cameron",
            "category": "หนังต่อสู้ แอกชัน หนังผจญภัย หนังแฟนตาซี",
            "picture": "https://movie.thaiware.com/upload_misc/movie/2022_11/original/221123120313227.jpg",
            "trailer": "https://www.youtube.com/embed/t0sCVZk0VVM",
            "review": {
                "review": "หนัง Avatar The Way of Water หรือชื่อไทยว่า อวตาร วิถีแห่งสายน้ำ ผ่านไปกว่า 10 ปี จากเหตุการณ์ในภาพยนตร์ภาคแรก “อวตาร: วิถีแห่งสายน้ำ” เริ่มต้นด้วยการเล่าเรื่องราวของครอบครัวซัลลี่ (เจค เนย์ทีรี่ และลูก ๆ ของพวกเขา) และปัญหาที่พวกเขาต้องเผชิญ ทั้งการพยายามอย่างหนักเพื่อปกป้องสมาชิกในครอบครัว การต่อสู้เอาชีวิตรอด และโศกนาฏกรรมที่พวกเขาต้องพบเจอ กำกับโดยเจมส์ คาเมรอน แสดงโดย แซม เวิร์ธธิงตัน โซอี ซัลดานา ซิกอร์นีย์ วีเวอร์ สตีเฟน แลง คลิฟ เคอร์ติส โจเอล เดวิด มัวร์ ซีซีเอส พาวเดอร์ เอดี้ ฟอลโก เจไมน์ คลีเมนท์ จิโอวานนี่ ริบิซี่ และ เคท วิทสเล็ท บทภาพยนตร์โดยเจมส์ คาเมรอน ริค แจฟฟา และ อแมนด้า ซิลเวอร์ เรื่องโดย เจมส์ คาเมรอน ริค แจฟฟา อแมนด้า ซิลเวอร์ จอร์จ ฟรีดแมน และ เชน ซาเลอร์โน่ อำนวยการสร้างโดย เจมส์ คาเมรอน และ จอห์น แลนเดา ร่วมด้วย เดวิด วัลเดส และ ริชาร์ด เบนแฮม ในฐานะผู้อำนวยการสร้างฝ่ายบริหาร อวตาร: วิถีแห่งสายน้ำเข้าฉายในโรงภาพยนตร์ 14 ธันวาคม 2565",
                "score": {
                    "screenPlay": 7,
                    "playing": 8,
                    "music": 8,
                    "actorSkills": 9.5,
                    "graphics": 10,
                    "average": 8.5
                }
            }
        },
        {
            "id": 2,
            "movieName": "Sick of Myself - ซิค ออฟ มายเซลฟ์",
            "movieLength": 95,
            "director": " Kristoffer Borgli",
            "category": "หนังตลก",
            "picture": "https://movie.thaiware.com/upload_misc/movie/2022_11/original/2211171203143v5.jpg",
            "trailer": "https://www.youtube.com/embed/1sCgMEpQ934",
            "review": {
                "review": "หนัง Sick of Myself หรือชื่อไทยว่า ซิค ออฟ มายเซลฟ์ “จะทำยังไงเมื่อหัวใจของคุณไม่ยอมมูฟออน“ เรื่องราวของ ซิงเนอ กับ ธอมัส ที่ความสัมพันธ์ระหว่างพวกเขาอยู่ในช่วงเปราะบาง ในขณะที่อาชีพหน้าที่การงานของแฟนหนุ่มกำลังรุ่งเรืองแซงหน้าขึ้นไปเรื่อย ๆ ในฐานะศิลปิน ทำให้เธอคิดหาวิธีพยายามตอบโต้และกระชับความสัมพันธ์ด้วยการวางแผนชั่วร้ายที่จะใช้ โรคกำเนิดใหม่ มาเป็นสิ่งเรียกร้องความสนใจ แต่กลายเป็นว่ามันมอบแรงดึงดูดจากทั้งสังคมมายังที่เธอ และมากกว่าผลลัพธ์ที่เธอได้คาดหวังไว้",
                "score": {
                    "screenPlay": 0,
                    "playing": 0,
                    "music": 0,
                    "actorSkills": 0,
                    "graphics": 0,
                    "average": 0
                }
            }
        },
        {
            "id": 3,
            "movieName": "Black Panther: Wakanda Forever - แบล็ค แพนเธอร์: วาคานด้าจงเจริญ",
            "movieLength": 161,
            "director": "Ryan Coogler",
            "category": "หนังต่อสู้แอกชัน หนังผจญภัย",
            "picture": "https://movie.thaiware.com/upload_misc/movie/2022_11/original/2533_22110913312505.jpg",
            "trailer": "https://www.youtube.com/embed/_Z3QKkl1WyM",
            "review": {
                "review": "หนัง Black Panther Wakanda Forever หรือชื่อไทยว่า แบล็ค แพนเธอร์ วาคานด้าจงเจริญ หลังจากที่สิ้นสุดเรื่องราวมหากาพย์ที่ดำเนินมากว่า 10 ปีไปแล้ว ในตอนนี้ MCU เฟสที่ 4 กำลังเดินหน้าไปในทิศทางใหม่ หนึ่งในภาพยนตร์ที่กำลังอยู๋ในช่วงถ่ายทำอยู่ในตอนนี้ก็คือ Black Panther: Wakanda Forever การกลับมาของดินแดนที่ซ่อนตัวมายาวนาน ดินแดนที่เต็มไปด้วยเทคโนโลยีสุดล้ำ กับการเปลี่ยนแปลงครั้งใหญ่ที่ดินแดนนี้ต้องเผชิญ และล่าสุดตอนนี้พวกเขาได้นักแสดงคนใหม่เข้ามาเสริมทัพแล้ว ราชินีรามอนด้า (แองเจลา บาสเซตต์) ชูรี(เลทิเทีย ไรท์) เอ็มบาคู(วินสตัน ดุ๊ก) โอโคเย(ดาไน กูริรา) และ โดรา มิลาเจ (รวมไปถึง ฟลอเรนซ์ คาซัมบา) จะต้องร่วมต่อสู้เพื่อปกป้องประเทศของพวกเขาจากการแทรกแซงทางอำนาจหลังการสวรรคตของกษัตริย์ทีชัลล่าในระหว่างที่ชาววาคานด้าพยายามอย่างหนักเพื่อที่จะก้าวต่อไป เหล่าฮีโร่จึงต้องร่วมมือกัน ด้วยความช่วยเหลือของวอร์ด็อกนาเคีย (ลูพีตา ญองอ) และ เอเวอเร็ตต์ รอสส์ (มาร์ติน ฟรีแมน) ในการสร้างเส้นทางใหม่ให้กับวานคานด้า ขอแนะนำ เตนอช เวร์ตา มารับบทเป็นนามอร์ กษัตริย์แห่งอาณาจักรลับใต้ท้องทะเล ภาพยนตร์เรื่องนี้ยังมี โดมินิก ธอร์น มีชาเอลา โคเอล มาเบล คาดีน่า และ อเล็กซ์ ลิวานัลลีร่วมแสดงอีกด้วย “แบล็ค แพนเธอร์: วอนคานด้าจงเจริญ” กำกับโดย ไรอัน คูเกลอร์ และอำนวยการสร้างโดย เควิน ไฟกี และ เนต มัวร์ เข้าฉายในไทย 9 พฤศจิกายน 2565 ",
                "score": {
                    "screenPlay": 5,
                    "playing": 5,
                    "music": 5,
                    "actorSkills": 8,
                    "graphics": 7,
                    "average": 6
                }
            }
        },
        {
            "id": 4,
            "movieName": "Top Gun: Maverick - ท็อปกัน : มาเวอริค",
            "movieLength": 130,
            "director": " Joseph Kosinski",
            "category": "หนังต่อสู้แอกชัน หนังดราม่า",
            "picture": "https://movie.thaiware.com/upload_misc/movie/2022_04/original/2204291200116hq.jpg",
            "trailer": "https://www.youtube.com/embed/qSqVVswa420",
            "review": {
                "review": "หนัง Top Gun Maverick หรือชื่อไทยว่า ท็อปกัน มาเวอริค หลังจากรับราชการเป็นนักบินระดับท็อปของกองทัพเรือมานานกว่า 30 ปี พีท “มาเวอริค” มิทเชลล์ (ทอม ครูซ) กลับมาสู่ที่ซึ่งเหมาะสมกับเขา เขากลับมาเป็นนักบินทดสอบผู้กล้าหาญและหลีกหนีจากความก้าวหน้าทางการงาน เขากลับมาฝึกหน่วยท็อปกันเพื่อปฏิบัติภารกิจพิเศษในรูปแบบที่ยังไม่เคยมีนักบินที่ยังมีชีวิตอยู่เคยเห็นมาก่อน มาเวอริคต้องเผชิญหน้ากับเรือโทแบรดลีย์ แบรดชอว์ (ไมล์ เทลเลอร์) หรือ “รูสเตอร์” ลูกชายของเรือโทนิค แบรดชอว์ หรือ “กูส” เพื่อนของเขาที่เสียชีวิตไปแล้ว เขาต้องพบกับอนาคตที่ไม่แน่นอนและอดีตที่ตามหลอกหลอน มาเวอริคต้องเผชิญกับความกลัวที่ฝังลึกอยู่ และปฏิบัติภารกิจให้สำเร็จ ซึ่งภารกิจนี้ผู้ที่ได้รับเลือกให้ร่วมบินต้องเสียสละอย่างที่สุด ทอม ครูซ กลับมารับบท พีท “มาเวอริค” มิทเชล นักบินขับไล่ของกองทัพอากาศสหรัฐฯ ภาพยนตร์กำกับโดย โจเซฟ โคซินสกี อำนวยการสร้างโดย เจอร์รี่ บรักไฮเมอร์ และเดวิน เอลลิสัน ร่วมบริหารงานสร้างโดย ทอมมี่ ฮาร์เปอร์, แชด โอมาน, ไมค์ สเตนสัน, ดานา โกลด์เบิร์ก และ ดอน แกรนเจอร์ นอกเหนือจาก ทอม ครูซ แล้ว Top Gun: Maverick ท็อปกัน: มาเวอริค ยังได้ ไมลส์ เทลเลอร์, เจนนิเฟอร์ คอนเนลลี, จอน แฮมม์, เกลน พาวเวลล์, ลูอิส พูลแมน และเอ็ด แฮร์ริส ร่วมเสริมทีมนักแสดง",
                "score": {
                    "screenPlay": 9,
                    "playing": 10,
                    "music": 10,
                    "actorSkills": 10,
                    "graphics": 10,
                    "average": 9.8
                }
            }
        },
        {
            "id": 5,
            "movieName": "Encanto - เมืองเวทย์มนต์ คนมหัศจรรย์",
            "movieLength": 110,
            "director": "Jared Bush, Charise Castro Smith",
            "category": "หนังผจญภัย หนังการ์ตูน หนังตลก",
            "picture": "https://movie.thaiware.com/upload_misc/movie/2021_11/original/21111012001149b.jpg",
            "trailer": "https://www.youtube.com/embed/CaimKeDcudo",
            "review": {
                "review": "หนัง Encanto หรือชื่อไทยว่า เมืองเวทมนตร์ คนมหัศจรรย์ สำหรับแอนิเมชั่น เรื่องใหม่ล่าสุดของดิสนีย์ คือ Encanto เมืองเวทมนตร์คนมหัศจรรย์ เล่าถึงมิราเบล คนธรรมดาเพียงคนเดียวในครอบครัวที่ไม่ธรรมดา เธอได้ค้นพบว่ามีอันตรายบางอย่างกำลังคืบคลานเข้ามา และเธอเป็นความหวังเดียวของครอบครัวที่จะต้องปกป้องทุกคน โดยในเรื่องเราจะเห็นตัวละครใน คาซ่า มาดริกาล สถานที่ ที่ทุกคนล้วนมีพลังวิเศษ มารวมตัวกัน แต่ละตัวละครจะมีพลังต่าง เช่น มีพละกำลัง เรียกสัตว์ เปลี่ยนสิ่งของ แปลงร่าง ทำให้ดอกไม้บาน ถือเป็นการนำเสนอตัวละครหญิงที่น่าสนใจและแตกต่างจากที่ก่อนหน้านี้ ดิสนีย์ ยกให้ตัวละครหญิง เป็น เจ้าหญิง",
                "score": {
                    "screenPlay": 9,
                    "playing": 9,
                    "music": 9,
                    "actorSkills": 9,
                    "graphics": 8.5,
                    "average": 8.5
                }
            }
        },
        {
            "id": 6,
            "movieName": "Wonder Woman 1984 - วันเดอร์ วูแมน 1984",
            "movieLength": 155,
            "director": "Patty Jenkins",
            "category": "หนังต่อสู้แอกชัน",
            "picture": "https://movie.thaiware.com/upload_misc/movie/2020_11/original/201122103021N55.jpg",
            "trailer": "https://www.youtube.com/embed/NVOzk3ZhsRg",
            "review": {
                "review": "Wonder Woman 1984 หรือชื่อไทยว่า วันเดอร์ วูแมน 1984 ผ่านช่วงเวลาหลายปีจากเหตุการณ์ในภาคแรกมาสู่ช่วงยุคสงครามเย็น ในครั้งนี้ Diana จะได้เผชิญกับภัยคุกคามครั้งใหม่ Cheetah และต้องรับมือกับ Maxwell Lord แถมยังมีเหตุการณ์สุดช็อคกับการกลับมามีชีวิตอีกครั้งของ Steve Trevor ",
                "score": {
                    "screenPlay": 9,
                    "playing": 8,
                    "music": 9,
                    "actorSkills": 8,
                    "graphics":8.5,
                    "average": 8.5
                }
            }
        }
    ]
}